modm-ext/data.modm.io/docs/svd/header_stm32h755xx_cm4.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>OPAMP1</name>
      <description>Operational Amplifier (OPAMP)</description>
      <alternatePeripheral>OPAMP</alternatePeripheral>
      <baseAddress>0x40009000</baseAddress>
      <registers>
        <register>
          <name>CSR</name>
          <description>OPAMP control/status register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>OPAEN</name>
              <description>Operational amplifier1 Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FORCEVP</name>
              <description>Force internal reference on VP</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VPSEL</name>
              <description>Non inverted input selection</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>VMSEL</name>
              <description>Inverting input selection</description>
              <bitOffset>5</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>OPAHSM</name>
              <description>Operational amplifier1 high speed mode</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CALON</name>
              <description>Calibration mode enable</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CALSEL</name>
              <description>Calibration selection</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>PGGAIN</name>
              <description>Operational amplifier1 Programmable amplifier gain value</description>
              <bitOffset>14</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>USERTRIM</name>
              <description>User trimming enable</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TSTREF</name>
              <description>OpAmp calibration reference voltage output control</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CALOUT</name>
              <description>Operational amplifier1 calibration output</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OTR</name>
          <description>OPAMP</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>TRIMOFFSETN</name>
              <description>Trim for NMOS differential pairs</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>TRIMOFFSETP</name>
              <description>Trim for PMOS differential pairs</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HSOTR</name>
          <description>OPAMP</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>TRIMHSOFFSETN</name>
              <description>Trim for NMOS differential pairs</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>TRIMHSOFFSETP</name>
              <description>Trim for PMOS differential pairs</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral derivedFrom="OPAMP1">
      <name>OPAMP2</name>
      <description>Operational Amplifier (OPAMP)</description>
      <baseAddress>0x40009010</baseAddress>
    </peripheral>
    <peripheral>
      <name>MDIOS</name>
      <description>MDIOS</description>
      <baseAddress>0x40009400</baseAddress>
      <interrupt>
        <name>MDIOS_WKUP</name>
        <description>MDIOS Wakeup Interrupt</description>
        <value>119</value>
      </interrupt>
      <interrupt>
        <name>MDIOS</name>
        <description>MDIOS global Interrupt</description>
        <value>120</value>
      </interrupt>
      <registers>
        <register>
          <name>CR</name>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>EN</name>
              <description>MDIOS slave peripheral enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WRIE</name>
              <description>MDIOS slave register write interrupt enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RDIE</name>
              <description>MDIOS slave register read interrupt enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EIE</name>
              <description>MDIOS slave register error interrupt enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DPC</name>
              <description>MDIOS slave disable preamble check</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PORT_ADDRESS</name>
              <description>MDIOS slave port address mask</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>WRFR</name>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>CWRFR</name>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RDFR</name>
          <addressOffset>0xc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>CRDFR</name>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>SR</name>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>PERF</name>
              <description>MDIOS slave turnaround error flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SERF</name>
              <description>MDIOS slave start error flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TERF</name>
              <description>MDIOS slave preamble error flag</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CLRFR</name>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>DINR0</name>
          <addressOffset>0x100</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>DINR1</name>
          <addressOffset>0x104</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>DINR2</name>
          <addressOffset>0x108</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>DINR3</name>
          <addressOffset>0x10c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>DINR4</name>
          <addressOffset>0x110</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>DINR5</name>
          <addressOffset>0x114</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>DINR6</name>
          <addressOffset>0x118</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>DINR7</name>
          <addressOffset>0x11c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>DINR8</name>
          <addressOffset>0x120</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>DINR9</name>
          <addressOffset>0x124</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>DINR10</name>
          <addressOffset>0x128</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>DINR11</name>
          <addressOffset>0x12c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>DINR12</name>
          <addressOffset>0x130</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>DINR13</name>
          <addressOffset>0x134</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>DINR14</name>
          <addressOffset>0x138</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>DINR15</name>
          <addressOffset>0x13c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>DINR16</name>
          <addressOffset>0x140</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>DINR17</name>
          <addressOffset>0x144</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>DINR18</name>
          <addressOffset>0x148</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>DINR19</name>
          <addressOffset>0x14c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>DINR20</name>
          <addressOffset>0x150</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>DINR21</name>
          <addressOffset>0x154</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>DINR22</name>
          <addressOffset>0x158</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>DINR23</name>
          <addressOffset>0x15c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>DINR24</name>
          <addressOffset>0x160</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>DINR25</name>
          <addressOffset>0x164</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>DINR26</name>
          <addressOffset>0x168</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>DINR27</name>
          <addressOffset>0x16c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>DINR28</name>
          <addressOffset>0x170</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>DINR29</name>
          <addressOffset>0x174</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>DINR30</name>
          <addressOffset>0x178</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>DINR31</name>
          <addressOffset>0x17c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>DOUTR0</name>
          <addressOffset>0x180</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>DOUTR1</name>
          <addressOffset>0x184</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>DOUTR2</name>
          <addressOffset>0x188</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>DOUTR3</name>
          <addressOffset>0x18c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>DOUTR4</name>
          <addressOffset>0x190</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>DOUTR5</name>
          <addressOffset>0x194</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>DOUTR6</name>
          <addressOffset>0x198</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>DOUTR7</name>
          <addressOffset>0x19c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>DOUTR8</name>
          <addressOffset>0x1a0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>DOUTR9</name>
          <addressOffset>0x1a4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>DOUTR10</name>
          <addressOffset>0x1a8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>DOUTR11</name>
          <addressOffset>0x1ac</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>DOUTR12</name>
          <addressOffset>0x1b0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>DOUTR13</name>
          <addressOffset>0x1b4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>DOUTR14</name>
          <addressOffset>0x1b8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>DOUTR15</name>
          <addressOffset>0x1bc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>DOUTR16</name>
          <addressOffset>0x1c0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>DOUTR17</name>
          <addressOffset>0x1c4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>DOUTR18</name>
          <addressOffset>0x1c8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>DOUTR19</name>
          <addressOffset>0x1cc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>DOUTR20</name>
          <addressOffset>0x1d0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>DOUTR21</name>
          <addressOffset>0x1d4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>DOUTR22</name>
          <addressOffset>0x1d8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>DOUTR23</name>
          <addressOffset>0x1dc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>DOUTR24</name>
          <addressOffset>0x1e0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>DOUTR25</name>
          <addressOffset>0x1e4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>DOUTR26</name>
          <addressOffset>0x1e8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>DOUTR27</name>
          <addressOffset>0x1ec</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>DOUTR28</name>
          <addressOffset>0x1f0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>DOUTR29</name>
          <addressOffset>0x1f4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>DOUTR30</name>
          <addressOffset>0x1f8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>DOUTR31</name>
          <addressOffset>0x1fc</addressOffset>
          <size>0x20</size>
        </register>
