modm-ext/data.modm.io/docs/svd/header_stm32h755xx_cm4.svd
        <register>
          <name>CMDR6</name>
          <description>MDMA channel x Mask Data register</description>
          <addressOffset>0x1f4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>MDR</name>
              <description>Mask Data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CISR7</name>
          <description>MDMA channel x interrupt/status register</description>
          <addressOffset>0x200</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>TEIF</name>
              <description>Channel x transfer error interrupt flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CTCIF</name>
              <description>Channel x Channel Transfer Complete interrupt flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BRTIF</name>
              <description>Channel x block repeat transfer complete interrupt flag</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BTIF</name>
              <description>Channel x block transfer complete interrupt flag</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TCIF</name>
              <description>Channel x buffer transfer complete interrupt flag</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CRQA</name>
              <description>Channel x request Active flag</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CIFCR7</name>
          <description>MDMA channel x interrupt flag clear register</description>
          <addressOffset>0x204</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CTEIF</name>
              <description>Channel x clear transfer error interrupt flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CCTCIF</name>
              <description>Clear Channel transfer complete interrupt flag for channel x</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CBRTIF</name>
              <description>Channel x clear block repeat transfer complete interrupt flag</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CBTIF</name>
              <description>Channel x Clear block transfer complete interrupt flag</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLTCIF</name>
              <description>CLear Transfer buffer Complete Interrupt Flag for channel</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CESR7</name>
          <description>MDMA Channel x error status register</description>
          <addressOffset>0x208</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>TEA</name>
              <description>Transfer Error Address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
            <field>
              <name>TED</name>
              <description>Transfer Error Direction</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TELD</name>
              <description>Transfer Error Link Data</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TEMD</name>
              <description>Transfer Error Mask Data</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ASE</name>
              <description>Address/Size Error</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BSE</name>
              <description>Block Size Error</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CCR7</name>
          <description>MDMA channel x control register</description>
          <addressOffset>0x20c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>EN</name>
              <description>Channel enable / flag channel ready when read low</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TEIE</name>
              <description>Transfer error interrupt enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CTCIE</name>
              <description>Channel Transfer Complete interrupt enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BRTIE</name>
              <description>Block Repeat transfer interrupt enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BTIE</name>
              <description>Block Transfer interrupt enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TCIE</name>
              <description>buffer Transfer Complete interrupt enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PL</name>
              <description>Priority level</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>BEX</name>
              <description>Byte Endianness eXchange</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HEX</name>
              <description>Half word Endianness eXchange</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WEX</name>
              <description>Word Endianness eXchange</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SWRQ</name>
              <description>SW ReQuest</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CTCR7</name>
          <description>MDMA channel x Transfer Configuration register</description>
          <addressOffset>0x210</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SINC</name>
              <description>Source increment mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>DINC</name>
              <description>Source increment mode</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>SSIZE</name>
              <description>Source data size</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>DSIZE</name>
              <description>Destination data size</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>SINCOS</name>
              <description>Source increment offset size</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>DINCOS</name>
              <description>Destination increment offset size</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>SBURST</name>
              <description>Source burst transfer configuration</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>DBURST</name>
              <description>Destination burst transfer configuration</description>
              <bitOffset>15</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>TLEN</name>
              <description>buffer Transfer Length (number of bytes - 1)</description>
              <bitOffset>18</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
            <field>
              <name>PKE</name>
              <description>PacK Enable</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PAM</name>
              <description>Padding/Alignment Mode</description>
              <bitOffset>26</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>TRGM</name>
              <description>Trigger Mode</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>SWRM</name>
              <description>SW Request Mode</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BWM</name>
              <description>Bufferable Write Mode</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CBNDTR7</name>
          <description>MDMA Channel x block number of data register</description>
          <addressOffset>0x214</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>BNDT</name>
              <description>Block Number of data bytes to transfer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>17</bitWidth>
            </field>
            <field>
              <name>BRSUM</name>
              <description>Block Repeat Source address Update Mode</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BRDUM</name>
              <description>Block Repeat Destination address Update Mode</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BRC</name>
              <description>Block Repeat Count</description>
              <bitOffset>20</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CSAR7</name>
          <description>MDMA channel x source address register</description>
          <addressOffset>0x218</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SAR</name>
              <description>Source address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CDAR7</name>
          <description>MDMA channel x destination address register</description>
          <addressOffset>0x21c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DAR</name>
              <description>Destination address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CBRUR7</name>
          <description>MDMA channel x Block Repeat address Update register</description>
          <addressOffset>0x220</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SUV</name>
              <description>Source address Update Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
            <field>
              <name>DUV</name>
              <description>Destination address Update Value</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CLAR7</name>
          <description>MDMA channel x Link Address register</description>
          <addressOffset>0x224</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>LAR</name>
              <description>Link Address Register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CTBR7</name>
          <description>MDMA channel x Trigger and Bus selection Register</description>
          <addressOffset>0x228</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>TSEL</name>
              <description>Trigger SELection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>SBUS</name>
              <description>Source BUS select</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DBUS</name>
              <description>Destination BUS select</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CMAR7</name>
          <description>MDMA channel x Mask address register</description>
          <addressOffset>0x230</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>MAR</name>
              <description>Mask address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CMDR7</name>
          <description>MDMA channel x Mask Data register</description>
          <addressOffset>0x234</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>MDR</name>
              <description>Mask Data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CISR8</name>
          <description>MDMA channel x interrupt/status register</description>
          <addressOffset>0x240</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>TEIF</name>
              <description>Channel x transfer error interrupt flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CTCIF</name>
              <description>Channel x Channel Transfer Complete interrupt flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BRTIF</name>
              <description>Channel x block repeat transfer complete interrupt flag</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BTIF</name>
              <description>Channel x block transfer complete interrupt flag</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TCIF</name>
              <description>Channel x buffer transfer complete interrupt flag</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CRQA</name>
              <description>Channel x request Active flag</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CIFCR8</name>
          <description>MDMA channel x interrupt flag clear register</description>
          <addressOffset>0x244</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CTEIF</name>
              <description>Channel x clear transfer error interrupt flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CCTCIF</name>
              <description>Clear Channel transfer complete interrupt flag for channel x</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CBRTIF</name>
              <description>Channel x clear block repeat transfer complete interrupt flag</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CBTIF</name>
              <description>Channel x Clear block transfer complete interrupt flag</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLTCIF</name>
              <description>CLear Transfer buffer Complete Interrupt Flag for channel</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CESR8</name>
          <description>MDMA Channel x error status register</description>
          <addressOffset>0x248</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>TEA</name>
              <description>Transfer Error Address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
            <field>
              <name>TED</name>
              <description>Transfer Error Direction</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TELD</name>
              <description>Transfer Error Link Data</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TEMD</name>
              <description>Transfer Error Mask Data</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ASE</name>
              <description>Address/Size Error</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BSE</name>
              <description>Block Size Error</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CCR8</name>
          <description>MDMA channel x control register</description>
          <addressOffset>0x24c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>EN</name>
              <description>Channel enable / flag channel ready when read low</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TEIE</name>
              <description>Transfer error interrupt enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CTCIE</name>
              <description>Channel Transfer Complete interrupt enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BRTIE</name>
              <description>Block Repeat transfer interrupt enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BTIE</name>
              <description>Block Transfer interrupt enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TCIE</name>
              <description>buffer Transfer Complete interrupt enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PL</name>
              <description>Priority level</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>BEX</name>
              <description>Byte Endianness eXchange</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HEX</name>
              <description>Half word Endianness eXchange</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WEX</name>
              <description>Word Endianness eXchange</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SWRQ</name>
              <description>SW ReQuest</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
